alibaba/AliOS-Things/platform/mcu/lpc54102/drivers/fsl_spi_dma.c
    /* Set SPI state to idle */
    handle->state = kSPI_Idle;

    /* Set handle to global state */
    s_dmaPrivateHandle[instance].base = base;
    s_dmaPrivateHandle[instance].handle = handle;

    /* Install callback for Tx dma channel */
    DMA_SetCallback(handle->txHandle, SPI_TxDMACallback, &s_dmaPrivateHandle[instance]);
    DMA_SetCallback(handle->rxHandle, SPI_RxDMACallback, &s_dmaPrivateHandle[instance]);

    return kStatus_Success;
}

status_t SPI_MasterTransferDMA(SPI_Type *base, spi_dma_handle_t *handle, spi_transfer_t *xfer)
{
    int32_t instance;
    status_t result = kStatus_Success;
    spi_config_tt *spi_config_p;

    assert(!((NULL == handle) || (NULL == xfer)));
    if ((NULL == handle) || (NULL == xfer))
    {
        return kStatus_InvalidArgument;
    }
    /* byte size is zero. */
    assert(!(xfer->dataSize == 0));
    if (xfer->dataSize == 0)
    {
        return kStatus_InvalidArgument;
    }

    /* cannot get instance from base address */
    instance = SPI_GetInstance(base);
    assert(!(instance < 0));
    if (instance < 0)
    {
        return kStatus_InvalidArgument;
    }

    /* Check if the device is busy */
    if (handle->state == kSPI_Busy)
    {
        return kStatus_SPI_Busy;
    }
    else
    {
        uint32_t tmp;
        dma_transfer_config_t xferConfig = {0};
        spi_config_p = (spi_config_tt *)SPI_GetConfig(base);

        handle->state = kStatus_SPI_Busy;
        handle->transferSize = xfer->dataSize;

        /* Receive */
        if (xfer->rxData)
        {
            if (SPI_IsRxFifoEnabled(base))
            {
                DMA_PrepareTransfer(&xferConfig, (void *)&VFIFO->SPI[instance].RXDATSPI, xfer->rxData,
                                    ((spi_config_p->dataWidth > 7U) ? (sizeof(uint16_t)) : (sizeof(uint8_t))),
                                    xfer->dataSize, kDMA_PeripheralToMemory, NULL);
            }
            else
            {
                DMA_PrepareTransfer(&xferConfig, (void *)&base->RXDAT, xfer->rxData,
                                    ((spi_config_p->dataWidth > 7U) ? (sizeof(uint16_t)) : (sizeof(uint8_t))),
                                    xfer->dataSize, kDMA_PeripheralToMemory, NULL);
            }
        }
        else
        {
            if (SPI_IsRxFifoEnabled(base))
            {
                DMA_PrepareTransfer(&xferConfig, (void *)&VFIFO->SPI[instance].RXDATSPI, &s_rxDummy,
                                    ((spi_config_p->dataWidth > 7U) ? (sizeof(uint16_t)) : (sizeof(uint8_t))),
                                    xfer->dataSize, kDMA_StaticToStatic, NULL);
            }
            else
            {
                DMA_PrepareTransfer(&xferConfig, (void *)&base->RXDAT, &s_rxDummy,
                                    ((spi_config_p->dataWidth > 7U) ? (sizeof(uint16_t)) : (sizeof(uint8_t))),
                                    xfer->dataSize, kDMA_StaticToStatic, NULL);
            }
        }
        DMA_SubmitTransfer(handle->rxHandle, &xferConfig);
        handle->rxInProgress = true;
        DMA_StartTransfer(handle->rxHandle);

        /* Transmit */
        tmp = 0;
        XferToFifoWR(xfer, &tmp);
        SpiConfigToFifoWR(spi_config_p, &tmp);

        if ((xfer->configFlags & kSPI_FrameAssert) &&
            ((spi_config_p->dataWidth > 7U) ? (xfer->dataSize > 2) : (xfer->dataSize > 1)))
        {
            if (spi_config_p->dataWidth > 7U)
            {
                s_txLastData[instance] =
                    tmp | ((uint32_t)(xfer->txData[xfer->dataSize - 1]) << 8U) | (xfer->txData[xfer->dataSize - 2]);
            }
            else
            {
                s_txLastData[instance] = tmp | (xfer->txData[xfer->dataSize - 1]);
            }

            /* If not the last data, clear the end of transfer control bit. */
            tmp &= ~((uint32_t)(kSPI_FrameAssert));
        }

        if (xfer->txData)
        {
            if (SPI_IsTxFifoEnabled(base))
            {
                if ((xfer->configFlags & kSPI_FrameAssert) &&
                    ((spi_config_p->dataWidth > 7U) ? (xfer->dataSize > 2) : (xfer->dataSize > 1)))
                {
                    dma_xfercfg_t tmp_xfercfg = {0};
                    tmp_xfercfg.valid = true;
                    tmp_xfercfg.swtrig = true;
                    tmp_xfercfg.intA = true;
                    tmp_xfercfg.byteWidth = sizeof(uint32_t);
                    tmp_xfercfg.srcInc = 0;
                    tmp_xfercfg.dstInc = 0;
                    tmp_xfercfg.transferCount = 1;
                    /* create chained descriptor to transmit last word */
                    DMA_CreateDescriptor(&s_spi_descriptor_table[instance], &tmp_xfercfg, &s_txLastData[instance],
                                         (uint32_t *)&VFIFO->SPI[instance].TXDATSPI, NULL);
                    if (spi_config_p->dataWidth > 7U)
                    {
                        DMA_PrepareTransfer(&xferConfig, (xfer->txData), (void *)&VFIFO->SPI[instance].TXDATSPI,
                                            sizeof(uint16_t), (xfer->dataSize - 2), kDMA_MemoryToPeripheral,
                                            &s_spi_descriptor_table[instance]);
                    }
                    else
                    {
                        DMA_PrepareTransfer(&xferConfig, xfer->txData, (void *)&VFIFO->SPI[instance].TXDATSPI,
                                            sizeof(uint8_t), (xfer->dataSize - 1), kDMA_MemoryToPeripheral,
                                            &s_spi_descriptor_table[instance]);
                    }

                    /* Disable interrupts for first descriptor to avoid calling callback twice */
                    xferConfig.xfercfg.intA = false;
                    xferConfig.xfercfg.intB = false;
                }
                else
                {
                    if (spi_config_p->dataWidth > 7U)
                    {
                        DMA_PrepareTransfer(&xferConfig, (xfer->txData), (void *)&VFIFO->SPI[instance].TXDATSPI,
                                            sizeof(uint16_t), (xfer->dataSize), kDMA_MemoryToPeripheral, NULL);
                    }
                    else
                    {
                        DMA_PrepareTransfer(&xferConfig, xfer->txData, (void *)&VFIFO->SPI[instance].TXDATSPI,
                                            sizeof(uint8_t), (xfer->dataSize), kDMA_MemoryToPeripheral, NULL);
                    }
                }
            }
            else
            {
                if ((xfer->configFlags & kSPI_FrameAssert) &&
                    ((spi_config_p->dataWidth > 7U) ? (xfer->dataSize > 2) : (xfer->dataSize > 1)))
                {
                    dma_xfercfg_t tmp_xfercfg = {0};
                    tmp_xfercfg.valid = true;
                    tmp_xfercfg.swtrig = true;
                    tmp_xfercfg.intA = true;
                    tmp_xfercfg.byteWidth = sizeof(uint32_t);
                    tmp_xfercfg.srcInc = 0;
                    tmp_xfercfg.dstInc = 0;
                    tmp_xfercfg.transferCount = 1;
                    /* Create chained descriptor to transmit last word */
                    DMA_CreateDescriptor(&s_spi_descriptor_table[instance], &tmp_xfercfg, &s_txLastData[instance],
                                         (uint32_t *)&base->TXDATCTL, NULL);
                    if (spi_config_p->dataWidth > 7U)
                    {
                        DMA_PrepareTransfer(&xferConfig, xfer->txData, (void *)&base->TXDAT, sizeof(uint16_t),
                                            (xfer->dataSize - 2), kDMA_MemoryToPeripheral,
                                            &s_spi_descriptor_table[instance]);
                    }
                    else
                    {
                        DMA_PrepareTransfer(&xferConfig, xfer->txData, (void *)&base->TXDAT, sizeof(uint8_t),
                                            (xfer->dataSize - 1), kDMA_MemoryToPeripheral,
                                            &s_spi_descriptor_table[instance]);
                    }
                    /* disable interrupts for first descriptor to avoid calling callback twice */
                    xferConfig.xfercfg.intA = false;
                    xferConfig.xfercfg.intB = false;
                }
                else
                {
                    if (spi_config_p->dataWidth > 7U)
                    {
                        DMA_PrepareTransfer(&xferConfig, xfer->txData, (void *)&base->TXDAT, sizeof(uint16_t),
                                            (xfer->dataSize), kDMA_MemoryToPeripheral, NULL);
                    }
                    else
                    {
                        DMA_PrepareTransfer(&xferConfig, xfer->txData, (void *)&base->TXDAT, sizeof(uint8_t),
                                            (xfer->dataSize), kDMA_MemoryToPeripheral, NULL);
                    }
                }
            }
            result = DMA_SubmitTransfer(handle->txHandle, &xferConfig);
            if (result != kStatus_Success)
            {
                return result;
            }
        }
        else
        {
            /* Create chained descriptor to transmit dummy word. */
            SPI_SetupDummy(base, &s_txDummy[instance], xfer, spi_config_p);

